InformationRegisters/ЭТ_КомиссияТО_ПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭТ_КомиссияТО_ПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭТ_КомиссияТО_МетодРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фиксированная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭТ_КомиссияТО_ПоУмолчанию/Ext/ManagerModule.bsl
Функция ПолучитьКомиссиюТОПоУмолчанию(Организация,Контрагент) ЭКСПОРТ
	КВозврату = Новый Структура("Контрагент,МетодРасчета,Процент,Фиксированная,НашДоговор,ИспользуемыйТипДаты,Сообщение,Ошибки");
	КВозврату.Контрагент = Контрагент;
	КВозврату.Сообщение = "Параметры комиссии ТО по умолчанию не заданы.";
	КВозврату.Ошибки = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭТ_КомиссияТО_ПоУмолчанию.МетодРасчета КАК МетодРасчета,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Процент КАК Процент,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Фиксированная КАК Фиксированная,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Контрагент КАК Контрагент,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ЭТ_КомиссияТО_ПоУмолчанию КАК ЭТ_КомиссияТО_ПоУмолчанию
		|ГДЕ
		|	ЭТ_КомиссияТО_ПоУмолчанию.Контрагент = &Контрагент
		|	И ЭТ_КомиссияТО_ПоУмолчанию.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КВозврату.МетодРасчета = ВыборкаДетальныеЗаписи.МетодРасчета;
		КВозврату.Процент = ВыборкаДетальныеЗаписи.Процент;
		КВозврату.Фиксированная = ВыборкаДетальныеЗаписи.Фиксированная;  
		КВозврату.Сообщение = "";
		КВозврату.Ошибки = Ложь;
	КонецЦикла;                       
	Возврат КВозврату;
КонецФункции
